# Introduction to Python: Pandas
## Programming tools, 2016 Winter semester, CEU
_Jeno Pal_, Jan-Feb 2016

## Introduction to Pandas

Pandas is the most widely-used data analysis library for Python. It makes common data manipulation tasks (reading/writing data, joins, aggregation, plotting) very easy and efficient. It was created by [Wes McKinney](http://wesmckinney.com/). We are only scratching the surface here, dive more into it using the following sources:

* check out his book: [Python for Data Analysis](http://shop.oreilly.com/product/0636920023784.do?cmp=af-prog-books-videos-lp-na_afp_book_mckinney_cj_12307942_7040302)
* check out the awesome [documentation](http://pandas.pydata.org/) with tons of examples
* [tutorials](http://pandas.pydata.org/pandas-docs/version/0.17.1/tutorials.html)

In [169]:
import pandas as pd

### Series and data frames

The two basic data structures of Pandas are Series and DataFrames.

In [170]:
# series is like a vector, or a column of data

import numpy as np

s = pd.Series(np.random.randn(5))
print(type(s))

<class 'pandas.core.series.Series'>

In [171]:
s

0   -3.004630
1    1.889141
2   -1.392735
3   -1.046412
4    0.752906
dtype: float64

In [172]:
# operations with series

abs(s)

0    3.004630
1    1.889141
2    1.392735
3    1.046412
4    0.752906
dtype: float64

In [173]:
s ** 2

0    9.027802
1    3.568853
2    1.939711
3    1.094977
4    0.566868
dtype: float64

In [174]:
# we can use indices
print(s[1])

# also, named indices can be used
s.index = ["A", "G", "F", "D", "B"]
print(s["F"])

1.88914079768
-1.39273495581

In [175]:
# boolean selection also works
s[s > 0.5]

G    1.889141
B    0.752906
dtype: float64

DataFrames are tables of variables: a row is an observation, a column is a variable.

In [176]:
# read csv files easily into data frames

df = pd.read_csv("../data/amazon_stock_data.csv")
df

            Date    Open    High     Low   Close    Volume  Adj Close
0     2015-01-14  291.93  295.91  286.50  293.27   5464600     293.27
1     2015-01-13  297.48  301.50  293.23  294.74   4130900     294.74
2     2015-01-12  297.56  298.51  289.28  291.41   3404300     291.41
3     2015-01-09  301.48  302.87  296.68  296.93   2589500     296.93
4     2015-01-08  300.32  303.14  296.11  300.46   3073700     300.46
5     2015-01-07  297.50  301.28  295.33  298.42   2612300     298.42
6     2015-01-06  302.24  303.00  292.38  295.29   3506200     295.29
7     2015-01-05  307.01  308.38  300.85  302.19   2763700     302.19
8     2015-01-02  312.58  314.75  306.96  308.52   2783200     308.52
9     2014-12-31  311.55  312.98  310.01  310.35   2048000     310.35
10    2014-12-30  311.44  313.91  309.37  310.47    109800     310.47
11    2014-12-29  307.85  314.27  306.58  312.04   2992500     312.04
12    2014-12-26  305.00  310.78  303.81  309.09   2887500     309.09
13    2014-12-24  306.38  307.00  302.88  303.03   1513800     303.03
14    2014-12-23  306.98  307.49  303.25  306.29   2713700     306.29
15    2014-12-22  301.94  307.36  301.94  306.54   3828800     306.54
16    2014-12-19  296.91  301.54  295.52  299.90   8541000     299.90
17    2014-12-18  304.01  304.50  293.25  297.73   7694600     297.73
18    2014-12-17  296.37  299.67  293.03  298.88   4399200     298.88
19    2014-12-16  304.35  304.49  295.01  295.06   6485300     295.06
20    2014-12-15  308.87  310.86  302.15  306.07   3830100     306.07
21    2014-12-12  303.99  310.64  303.01  307.32   3153500     307.32
22    2014-12-11  307.89  312.64  306.01  307.36   3263500     307.36
23    2014-12-10  312.00  313.19  304.68  305.84   3229100     305.84
24    2014-12-09  302.99  313.64  301.14  312.50   4027800     312.50
25    2014-12-08  311.57  316.56  304.82  306.64   3625800     306.64
26    2014-12-05  316.80  316.93  310.84  312.63   3257700     312.63
27    2014-12-04  315.53  318.59  313.47  316.93   3290300     316.93
28    2014-12-03  325.73  326.77  314.36  316.50   5681000     316.50
29    2014-12-02  327.50  327.93  323.25  326.31   2783500     326.31
...          ...     ...     ...     ...     ...       ...        ...
4415  1997-06-27   18.19   18.19   17.75   17.87   1188000       1.49
4416  1997-06-26   18.25   18.25   18.06   18.13   3189600       1.51
4417  1997-06-25   18.31   18.31   17.87   18.13   2106000       1.51
4418  1997-06-24   18.06   18.31   17.75   18.13    751200       1.51
4419  1997-06-23   18.50   18.50   17.75   18.00   1047600       1.50
4420  1997-06-20   18.38   18.62   18.00   18.31   3387600       1.53
4421  1997-06-19   18.13   18.38   18.00   18.13   1003200       1.51
4422  1997-06-18   18.25   18.44   18.00   18.13   2464800       1.51
4423  1997-06-17   19.19   19.19   17.94   18.06   4706400       1.51
4424  1997-06-16   19.25   19.25   18.75   18.88    913200       1.57
4425  1997-06-13   19.50   19.50   19.00   19.00    693600       1.58
4426  1997-06-12   19.00   19.75   18.62   19.25   1632000       1.60
4427  1997-06-11   19.12   19.25   18.38   18.50   1188000       1.54
4428  1997-06-10   20.50   20.50   18.38   19.00   5458800       1.58
4429  1997-06-09   19.88   20.50   19.88   20.25   2352000       1.69
4430  1997-06-06   18.19   20.50   18.13   19.88   7807200       1.66
4431  1997-06-05   17.00   18.50   16.50   18.50   5672400       1.54
4432  1997-06-04   17.75   17.87   16.75   17.00   3080400       1.42
4433  1997-06-03   18.38   18.38   17.75   17.75   1183200       1.48
4434  1997-06-02   18.13   18.38   18.00   18.13    591600       1.51
4435  1997-05-30   18.00   18.13   17.75   18.00   2594400       1.50
4436  1997-05-29   18.50   18.50   17.75   18.06   3472800       1.51
4437  1997-05-28   19.50   19.63   18.38   18.38   4574400       1.53
4438  1997-05-27   18.13   19.75   17.50   19.00   8697600       1.58
4439  1997-05-23   16.88   18.25   16.00   18.00  15937200       1.50
4440  1997-05-22   17.25   17.38   15.75   16.75  11776800       1.40
4441  1997-05-21   19.63   19.75   16.50   17.12  18853200       1.43
4442  1997-05-20   20.75   21.00   19.63   19.63   5467200       1.64
4443  1997-05-19   21.13   21.25   19.50   20.50   6106800       1.71
4444  1997-05-16   23.62   23.75   20.50   20.75  14700000       1.73

[4445 rows x 7 columns]

In [177]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Volume', 'Adj Close'], dtype='object')

### Select rows and columns

Colunns can be selected individually: each one is a Series.

In [178]:
df.Open

0       291.93
1       297.48
2       297.56
3       301.48
4       300.32
5       297.50
6       302.24
7       307.01
8       312.58
9       311.55
10      311.44
11      307.85
12      305.00
13      306.38
14      306.98
15      301.94
16      296.91
17      304.01
18      296.37
19      304.35
20      308.87
21      303.99
22      307.89
23      312.00
24      302.99
25      311.57
26      316.80
27      315.53
28      325.73
29      327.50
         ...
4415     18.19
4416     18.25
4417     18.31
4418     18.06
4419     18.50
4420     18.38
4421     18.13
4422     18.25
4423     19.19
4424     19.25
4425     19.50
4426     19.00
4427     19.12
4428     20.50
4429     19.88
4430     18.19
4431     17.00
4432     17.75
4433     18.38
4434     18.13
4435     18.00
4436     18.50
4437     19.50
4438     18.13
4439     16.88
4440     17.25
4441     19.63
4442     20.75
4443     21.13
4444     23.62
Name: Open, dtype: float64

In [179]:
# copy to a new variable
vec_open = df.Open.copy()
print(type(vec_open))

# .head() shows the first few elements
print(vec_open.head())

<class 'pandas.core.series.Series'>
0    291.93
1    297.48
2    297.56
3    301.48
4    300.32
Name: Open, dtype: float64

Multiple columns can be selected by supplying a list of column names within square brackets.

In [180]:
df_date_open = df[["Date", "Open"]].copy()

In [181]:
df_date_open.head(10)

         Date    Open
0  2015-01-14  291.93
1  2015-01-13  297.48
2  2015-01-12  297.56
3  2015-01-09  301.48
4  2015-01-08  300.32
5  2015-01-07  297.50
6  2015-01-06  302.24
7  2015-01-05  307.01
8  2015-01-02  312.58
9  2014-12-31  311.55

Rows can be selected by indices.

In [182]:
df.ix[1:3, ]

         Date    Open    High     Low   Close   Volume  Adj Close
1  2015-01-13  297.48  301.50  293.23  294.74  4130900     294.74
2  2015-01-12  297.56  298.51  289.28  291.41  3404300     291.41
3  2015-01-09  301.48  302.87  296.68  296.93  2589500     296.93

But also using boolean expressions.

In [183]:
df[df.Open > 298].head()

         Date    Open    High     Low   Close   Volume  Adj Close
3  2015-01-09  301.48  302.87  296.68  296.93  2589500     296.93
4  2015-01-08  300.32  303.14  296.11  300.46  3073700     300.46
6  2015-01-06  302.24  303.00  292.38  295.29  3506200     295.29
7  2015-01-05  307.01  308.38  300.85  302.19  2763700     302.19
8  2015-01-02  312.58  314.75  306.96  308.52  2783200     308.52

Row and column selection can be combined using `.ix[]`.

In [184]:
df.ix[2:5, ["Open", "Close"]]

     Open   Close
2  297.56  291.41
3  301.48  296.93
4  300.32  300.46
5  297.50  298.42

### Creating new variables

New variables can be added with a syntax similar to dictionaries.

In [185]:
df["Middle"] = (df["Open"] + df["Close"])/2
df.head()

         Date    Open    High     Low   Close   Volume  Adj Close   Middle
0  2015-01-14  291.93  295.91  286.50  293.27  5464600     293.27  292.600
1  2015-01-13  297.48  301.50  293.23  294.74  4130900     294.74  296.110
2  2015-01-12  297.56  298.51  289.28  291.41  3404300     291.41  294.485
3  2015-01-09  301.48  302.87  296.68  296.93  2589500     296.93  299.205
4  2015-01-08  300.32  303.14  296.11  300.46  3073700     300.46  300.390

More complicated functions can be applied, too, using the `.apply()` method.

In [186]:
def get_year(date):
    return date.split("-")[0]

In [187]:
df["Year"] = df.Date.apply(get_year)
df.head()

,Date,Open,High,Low,Close,Volume,Adj Close,Middle,Year
0,2015-01-14,291.93,295.91,286.50,293.27,5464600,293.27,292.600,2015
1,2015-01-13,297.48,301.50,293.23,294.74,4130900,294.74,296.110,2015
2,2015-01-12,297.56,298.51,289.28,291.41,3404300,291.41,294.485,2015
3,2015-01-09,301.48,302.87,296.68,296.93,2589500,296.93,299.205,2015
4,2015-01-08,300.32,303.14,296.11,300.46,3073700,300.46,300.390,2015

### Missing data

Missing data is handled by `np.nan` values which are borrowed from the NumPy module.

In [188]:
dd = pd.DataFrame({"foo": np.array([3, 4, np.nan, 7, 9]), "bar" : ["A", "B", "C", "D", "E"]})
dd

  bar  foo
0   A    3
1   B    4
2   C  NaN
3   D    7
4   E    9

`.notnull()` and `.isnull()` are useful Series methods that return boolean values and test if Series elements are missing or not. We can use these for row selection, too.

In [189]:
dd[dd.foo.isnull()]

  bar  foo
2   C  NaN

In [190]:
dd[dd.foo.notnull()]

  bar  foo
0   A    3
1   B    4
3   D    7
4   E    9

### Aggregation operations

There are efficient methods for aggregating rows of data frames, also by groups.

In [191]:
# get the mean of Open
df.Open.mean()

107.55967154105737

In [192]:
df.Close.sum()

478390.120000001

In [193]:
# count the non-missing values
df.Year.count()

4445

In [194]:
# get the number of days in each year
count_days = df.groupby("Year").Open.count()
print(type(count_days))

# this is a series with indices taken from the grouping variable
print(count_days.head())
count_days["2000"]

<class 'pandas.core.series.Series'>
Year
1997    159
1998    252
1999    252
2000    252
2001    248
Name: Open, dtype: int64

252

In [195]:
# value_counts counts the number of occurences of values
count_days.value_counts()

252    12
251     2
159     1
253     1
250     1
248     1
9       1
Name: Open, dtype: int64

### Plotting

Using Python's main plotting library `matplotlib`, Pandas is able to create simple but useful graphs based on series or data frames.

In [196]:
import matplotlib.pyplot as plt

In [197]:
df.Open.plot()
plt.show()

In [198]:
# save figures

plt.cla()    # clears the plot axes
df.Open.plot()
plt.savefig("../output/opening_prices.png")

In [199]:
# many other types of figures can be plotted, you can customize labels, axes, etc.
plt.cla()
# count the number of days in each year and plot it as a bar chart
df.groupby("Year").Open.count().plot(kind="bar", color="red")
plt.savefig("../output/days_in_years.png")

### Reading and writing data

Besides the previously seen `read_csv` function, we can write out dataframes to files, too. Both have many useful options, use the documentation and the help to explore them!

In [200]:
df = pd.read_csv("../data/amazon_stock_data.csv")

In [201]:
dd = pd.DataFrame({"foo": np.array([3, 4, np.nan, 7, 9]), "bar" : ["A", "B", "C", "D", "E"]})

In [202]:
# don't output the indices
dd.to_csv("../output/foobar.csv", index=False)